In [1]:
import sqlite3

In [2]:
from sqlite3 import Error

In [3]:
import pandas as pd

In [4]:
#Creating a new db using python

def create_connection(db_file):
    """create db connection to SQLite Db"""
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)
    finally:
        if conn:
            conn.close()

In [5]:
# if __name__=='__main__':
#     create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

In [8]:
create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

In [6]:
conn = sqlite3.connect('pythonsqlite.db')

In [7]:
cur=conn.cursor()

 #### Creating a grocery list : Bananas (4), Peanut Butter (1), Dark Chocolate bars (2)

In [19]:
#create table
cur.execute("""CREATE TABLE groceries (id INTEGER PRIMARY KEY, name TEXT, quantity INTEGER);""")

In [20]:
pd.DataFrame(cur.execute("""SELECT * FROM groceries;""").fetchall())

Empty DataFrame
Columns: []
Index: []

In [21]:
cur.description

(('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('quantity', None, None, None, None, None, None))

In [9]:
def sql_to_pd(query):
    df = pd.DataFrame(cur.execute(query).fetchall())
    df.columns = [x[0] for x in cur.description]
    return df

In [14]:
cur.execute("""INSERT INTO groceries VALUES (1,"Bananas", 4);""")

In [15]:
sql_to_pd("""SELECT * FROM groceries;""")

   id     name  quantity
0   1  Bananas         4

In [16]:
cur.execute("""INSERT INTO groceries VALUES (2, "Peanut Butter", 1);""")
cur.execute("""INSERT INTO groceries VALUES (3, "Dark Chocolate Bars", 2);""")

In [17]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity
0   1              Bananas         4
1   2        Peanut Butter         1
2   3  Dark Chocolate Bars         2

#### Add column

In [18]:
cur.execute("""ALTER TABLE groceries
                ADD aisle INTEGER;""")

In [19]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

In [20]:
cur.execute("""INSERT INTO groceries(aisle)
                VALUES (7)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

In [21]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas       4.0    NaN
1   2        Peanut Butter       1.0    NaN
2   3  Dark Chocolate Bars       2.0    NaN
3   4                 None       NaN    7.0
4   5                 None       NaN    2.0
5   6                 None       NaN    2.0

#### Delete rows

In [22]:
cur.execute("""DELETE FROM groceries WHERE id=4;""")
cur.execute("""DELETE FROM groceries WHERE id=5;""")
cur.execute("""DELETE FROM groceries WHERE id=6;""")

In [23]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

#### Update Value

In [24]:
cur.execute("""UPDATE groceries
                SET aisle = 7
                WHERE id = 1;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 2;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 3;""")

In [25]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2

In [26]:
cur.execute("""INSERT INTO groceries VALUES (4, "Ice Cream", 1, 12);""")
cur.execute("""INSERT INTO groceries VALUES (5, "Cherries", 6, 2);""")
cur.execute("""INSERT INTO groceries VALUES (6, "Chocolate Syrup", 1, 4);""")

In [27]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2
3   4            Ice Cream         1     12
4   5             Cherries         6      2
5   6      Chocolate Syrup         1      4

In [28]:
sql_to_pd("""SELECT * FROM groceries ORDER BY aisle;""")

   id                 name  quantity  aisle
0   2        Peanut Butter         1      2
1   3  Dark Chocolate Bars         2      2
2   5             Cherries         6      2
3   6      Chocolate Syrup         1      4
4   1              Bananas         4      7
5   4            Ice Cream         1     12

In [29]:
sql_to_pd("""SELECT * FROM groceries WHERE aisle>5 ORDER BY aisle;""")

   id       name  quantity  aisle
0   1    Bananas         4      7
1   4  Ice Cream         1     12

#### Aggregating Data

In [30]:
cur.execute("""SELECT SUM(quantity) FROM groceries;""").fetchall()

[(15,)]

In [31]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries;""")

   SUM(quantity)
0             15

In [32]:
sql_to_pd("""SELECT MAX(quantity) FROM groceries;""")

   MAX(quantity)
0              6

In [33]:
sql_to_pd("""SELECT name, MAX(quantity) FROM groceries;""")

       name  MAX(quantity)
0  Cherries              6

In [34]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries GROUP BY aisle;""")

   SUM(quantity)
0              9
1              1
2              4
3              1

In [35]:
sql_to_pd("""SELECT aisle, SUM(quantity) FROM groceries GROUP BY aisle;""")

   aisle  SUM(quantity)
0      2              9
1      4              1
2      7              4
3     12              1

### More Complex Queries

In [39]:
cur.execute("""CREATE TABLE excercise_logs (id INTEGER PRIMARY KEY AUTOINCREMENT, type TEXT, minutes INTEGER,
                calories INTEGER, heart_rate INTEGER);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("biking", 30, 100, 110);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("biking", 10, 30, 105);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("dancing", 15, 200, 120);""")

In [41]:
sql_to_pd("""SELECT * FROM excercise_logs""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

In [42]:
cur.execute("""ALTER TABLE excercise_logs
                RENAME TO exercise_logs;""")

In [43]:
sql_to_pd("""SELECT * FROM exercise_logs""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

#### AND Keyword

In [44]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE calories>50 AND minutes<30;""")

   id     type  minutes  calories  heart_rate
0   3  dancing       15       200         120

In [45]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE calories>50 OR heart_rate>100;""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

**And** has precedence over **or** if both are used in the same statement, but can use parenthesis to change the order of evaluation

#### Querying in Subqueries

In [48]:
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("tree climbing", 30, 70, 90);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("tree climbing", 25, 72, 80);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("rowing", 30, 70, 90);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("hiking", 60, 80, 85);""")

In [50]:
sql_to_pd("""SELECT * FROM exercise_logs""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   3        dancing       15       200         120
3   4  tree climbing       30        70          90
4   5  tree climbing       25        72          80
5   6  tree climbing       30        70          90
6   7  tree climbing       25        72          80
7   8         rowing       30        70          90
8   9         hiking       60        80          85

In [51]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type ="biking";""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105

In [52]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type ="biking" OR type="rowing" OR type = "hiking";""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105
2   8  rowing       30        70          90
3   9  hiking       60        80          85

Instead, use IN operator

##### The **IN** Operator

In [54]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN ("biking","rowing","hiking","tree climbing");""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   4  tree climbing       30        70          90
3   5  tree climbing       25        72          80
4   6  tree climbing       30        70          90
5   7  tree climbing       25        72          80
6   8         rowing       30        70          90
7   9         hiking       60        80          85

##### Inverse query

In [55]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type NOT IN ("biking","rowing","hiking","tree climbing");""")

   id     type  minutes  calories  heart_rate
0   3  dancing       15       200         120

In [56]:
cur.execute("""CREATE TABLE drs_favorites
    (id INTEGER PRIMARY KEY,
    type TEXT,
    reason TEXT);""" )

cur.execute("""INSERT INTO drs_favorites(type, reason) VALUES ("biking", "Improves endurance and flexibility.");""")
cur.execute("""INSERT INTO drs_favorites(type, reason) VALUES ("hiking", "Increases cardiovascular health.");""")

In [57]:
sql_to_pd("""SELECT * FROM drs_favorites""")

   id    type                               reason
0   1  biking  Improves endurance and flexibility.
1   2  hiking     Increases cardiovascular health.

In [58]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites)""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105
2   9  hiking       60        80          85

In [64]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites WHERE reason = "Increases cardiovascular health.");""")

   id    type  minutes  calories  heart_rate
0   9  hiking       60        80          85

Errors out if not exact match in the string. can also do a non exact match

##### LIKE Operator

In [66]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites WHERE reason LIKE "%cardiovascular%");""")

   id    type  minutes  calories  heart_rate
0   9  hiking       60        80          85

#### Restricting grouped results with HAVING

In [67]:
sql_to_pd("""SELECT type, SUM(calories) FROM exercise_logs GROUP BY type;""")

            type  SUM(calories)
0         biking            130
1        dancing            200
2         hiking             80
3         rowing             70
4  tree climbing            284

In [68]:
sql_to_pd("""SELECT type, SUM(calories) AS total_calories FROM exercise_logs GROUP BY type;""")

            type  total_calories
0         biking             130
1        dancing             200
2         hiking              80
3         rowing              70
4  tree climbing             284

WHERE only filters out individual logs. For aggregate, HAVING

In [70]:
sql_to_pd("""SELECT type, SUM(calories) AS total_calories FROM exercise_logs GROUP BY type HAVING total_calories>150;""")

            type  total_calories
0        dancing             200
1  tree climbing             284

In [72]:
sql_to_pd("""SELECT type, AVG(calories) AS average_calories FROM exercise_logs GROUP BY type
                HAVING average_calories>70""")

            type  average_calories
0        dancing             200.0
1         hiking              80.0
2  tree climbing              71.0

Only those activities which have been logged more than once: COUNT

##### COUNT Operator

In [73]:
sql_to_pd("""SELECT type FROM exercise_logs GROUP BY type HAVING COUNT(*)>=2;""")

            type
0         biking
1  tree climbing